[
    {
      "name": "Spurti Devadhar",
      "review": "Pathetic.We admitted my 88-year Grandpa for a cardiac emergency. They kept him on a temporary pacemaker for 1 week and made him undergo 3 dialysis sessions. He was assigned to the basement ICU. After 7 days, we were not happy with the treatment and took him home after some unimaginably terrible bed sores. They also scared us that he was in no condition to be taken home and that he would collapse immediately. The doctor on duty was very harsh while removing the temporary Pacemaker. Overall, we were very disheartened by the entire treatment procedure, the doctors and the attitude of the sisters on call. Only some of the cleaning ladies were empathetic.Pathetic.We admitted my 88-year Grandpa for a cardiac emergency. They kept him on a temporary pacemaker for 1 week and made him undergo 3 dialysis sessions. He was …More",
      "rating": 1,
      "date": "Jun 2023",
      "sentiment": "Neutral"
    },
    {
      "name": "Vijay News & Media",
      "review": "After a long time n gap of 10 years had gone for a health checkup, To my astonishment everything had changed, the opd registration counter ques were filled with full capacity almost breathless in the queue, housefull with opd patients.I wish online registration cones ASAP.  Need more doctors for quick consultation & treatment.Registration counter should be revamped.& All other things are going n in great conditionAfter a long time n gap of 10 years had gone for a health checkup, To my astonishment everything had changed, the opd registration counter ques were filled with full capacity almost breathless in the queue, housefull with opd patients. …More",
      "rating": 3,
      "date": "Jun 2023",
      "sentiment": "Neutral"
    },
    {
      "name": "syed imran",
      "review": "Best hospital for heart'treatment in less money for BPL holders",
      "rating": 3,
      "date": "Jun 2023",
      "sentiment": "Neutral"
    },
    {
      "name": "RANJAN P",
      "review": "Good care very clean best environment",
      "rating": 5,
      "date": "Jun 2023",
      "sentiment": "Positive"
    },
    {
      "name": "Flip Calls",
      "review": "Well managed Hospital for Heart diseases...",
      "rating": 4,
      "date": "Jun 2023",
      "sentiment": "Positive"
    },
    {
      "name": "ayesha saleha",
      "review": "One of the best hospitals in Bengaluru for cardiology",
      "rating": 5,
      "date": "Jun 2023",
      "sentiment": "Neutral"
    },
    {
      "name": "Savi Savi",
      "review": "Any nursing staff vacancy is their",
      "rating": 1,
      "date": "Jun 2023",
      "sentiment": "Neutral"
    },
    {
      "name": "Rajesh Kumar",
      "review": "Very good",
      "rating": 5,
      "date": "Jun 2023",
      "sentiment": "Positive"
    }]